# Напишите функцию где исходный список содержит положительные и отрицательные
# числа. Требуется положительные поместить в один список, а отрицательные - в другой.
source_list=[-1,1,2,4,-23,-5,-5,-6]
for x in source_list:
	if x>0:
		print(x)
	if x<0:
		print(x)	
